espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
/******************************************************************************
*  Filename:       hw_cpu_etm_h
*  Revised:        $Date$
*  Revision:       $Revision$
*
* Copyright (c) 2015 - 2017, Texas Instruments Incorporated
* All rights reserved.
*
* Redistribution and use in source and binary forms, with or without
* modification, are permitted provided that the following conditions are met:
*
* 1) Redistributions of source code must retain the above copyright notice,
*    this list of conditions and the following disclaimer.
*
* 2) Redistributions in binary form must reproduce the above copyright notice,
*    this list of conditions and the following disclaimer in the documentation
*    and/or other materials provided with the distribution.
*
* 3) Neither the name of the ORGANIZATION nor the names of its contributors may
*    be used to endorse or promote products derived from this software without
*    specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
* IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
* ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
* LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
* CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
* SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
* CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
* ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
* POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/

#ifndef __HW_CPU_ETM_H__
#define __HW_CPU_ETM_H__

//*****************************************************************************
//
// This section defines the register offsets of
// CPU_ETM component
//
//*****************************************************************************
// Programming Control Register
#define CPU_ETM_O_TRCPRGCTLR                                        0x00000004

// The TRCSTATR indicates the ETM-Teal status
#define CPU_ETM_O_TRCSTATR                                          0x0000000C

// The TRCCONFIGR sets the basic tracing options for the trace unit
#define CPU_ETM_O_TRCCONFIGR                                        0x00000010

// The TRCEVENTCTL0R controls the tracing of events in the trace stream. The
// events also drive the ETM-Teal external outputs.
#define CPU_ETM_O_TRCEVENTCTL0R                                     0x00000020

// The TRCEVENTCTL1R controls how the events selected by TRCEVENTCTL0R behave
#define CPU_ETM_O_TRCEVENTCTL1R                                     0x00000024

// The TRCSTALLCTLR enables ETM-Teal to stall the processor if the ETM-Teal
// FIFO goes over the programmed level to minimize risk of overflow
#define CPU_ETM_O_TRCSTALLCTLR                                      0x0000002C

// The TRCTSCTLR controls the insertion of global timestamps into the trace
// stream. A timestamp is always inserted into the instruction trace stream
#define CPU_ETM_O_TRCTSCTLR                                         0x00000030

// The TRCSYNCPR specifies the period of trace synchronization of the trace
// streams. TRCSYNCPR defines a number of bytes of trace between requests for
// trace synchronization. This value is always a power of two
#define CPU_ETM_O_TRCSYNCPR                                         0x00000034

// The TRCCCCTLR sets the threshold value for instruction trace cycle counting.
// The threshold represents the minimum interval between cycle count trace
// packets
#define CPU_ETM_O_TRCCCCTLR                                         0x00000038

// The TRCVICTLR controls instruction trace filtering
#define CPU_ETM_O_TRCVICTLR                                         0x00000080

// The TRCCNTRLDVR defines the reload value for the reduced function counter
#define CPU_ETM_O_TRCCNTRLDVR0                                      0x00000140

// The TRCCNTRLDVR defines the reload value for the reduced function counter
#define CPU_ETM_O_TRCCNTRLDVR1                                      0x00000144

// The TRCCNTRLDVR defines the reload value for the reduced function counter
#define CPU_ETM_O_TRCCNTRLDVR2                                      0x00000148

// TRCIDR8
#define CPU_ETM_O_TRCIDR8                                           0x00000180

// TRCIDR9
#define CPU_ETM_O_TRCIDR9                                           0x00000184

// TRCIDR10
#define CPU_ETM_O_TRCIDR10                                          0x00000188

// TRCIDR11
#define CPU_ETM_O_TRCIDR11                                          0x0000018C

// TRCIDR12
#define CPU_ETM_O_TRCIDR12                                          0x00000190

// TRCIDR13
#define CPU_ETM_O_TRCIDR13                                          0x00000194

// The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features,
// and enables any features that are provided
#define CPU_ETM_O_TRCIMSPEC0                                        0x000001C0

// The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features,
// and enables any features that are provided
#define CPU_ETM_O_TRCIMSPEC1                                        0x000001C4

// The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features,
// and enables any features that are provided
#define CPU_ETM_O_TRCIMSPEC2                                        0x000001C8

// The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features,
// and enables any features that are provided
#define CPU_ETM_O_TRCIMSPEC3                                        0x000001CC

// The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features,
// and enables any features that are provided
#define CPU_ETM_O_TRCIMSPEC4                                        0x000001D0

// The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features,
// and enables any features that are provided
#define CPU_ETM_O_TRCIMSPEC5                                        0x000001D4

// The TRCIMSPEC shows the presence of any IMPLEMENTATION SPECIFIC features,
// and enables any features that are provided
#define CPU_ETM_O_TRCIMSPEC6                                        0x000001D8

// TRCIDR0
#define CPU_ETM_O_TRCIDR0                                           0x000001E0

// TRCIDR1
#define CPU_ETM_O_TRCIDR1                                           0x000001E4

// TRCIDR2
#define CPU_ETM_O_TRCIDR2                                           0x000001E8

// TRCIDR3
#define CPU_ETM_O_TRCIDR3                                           0x000001EC

// TRCIDR4
#define CPU_ETM_O_TRCIDR4                                           0x000001F0

