espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// TRCIDR5
#define CPU_ETM_O_TRCIDR5                                           0x000001F4

// TRCIDR6
#define CPU_ETM_O_TRCIDR6                                           0x000001F8

// TRCIDR7
#define CPU_ETM_O_TRCIDR7                                           0x000001FC

// The TRCRSCTLR controls the trace resources
#define CPU_ETM_O_TRCRSCTLR2                                        0x00000208

// The TRCRSCTLR controls the trace resources
#define CPU_ETM_O_TRCRSCTLR3                                        0x0000020C

// Controls the corresponding single-shot comparator resource
#define CPU_ETM_O_TRCSSCSR0                                         0x000002A0

// Controls the corresponding single-shot comparator resource
#define CPU_ETM_O_TRCSSCSR1                                         0x000002A4

// Controls the corresponding single-shot comparator resource
#define CPU_ETM_O_TRCSSCSR2                                         0x000002A8

// Controls the corresponding single-shot comparator resource
#define CPU_ETM_O_TRCSSCSR3                                         0x000002AC

// Controls the corresponding single-shot comparator resource
#define CPU_ETM_O_TRCSSCSR4                                         0x000002B0

// Controls the corresponding single-shot comparator resource
#define CPU_ETM_O_TRCSSCSR5                                         0x000002B4

// Controls the corresponding single-shot comparator resource
#define CPU_ETM_O_TRCSSCSR6                                         0x000002B8

// Selects the PE comparator inputs for Single-shot control
#define CPU_ETM_O_TRCSSPCICR0                                       0x000002C0

// Selects the PE comparator inputs for Single-shot control
#define CPU_ETM_O_TRCSSPCICR1                                       0x000002C4

// Selects the PE comparator inputs for Single-shot control
#define CPU_ETM_O_TRCSSPCICR2                                       0x000002C8

// Selects the PE comparator inputs for Single-shot control
#define CPU_ETM_O_TRCSSPCICR3                                       0x000002CC

// Selects the PE comparator inputs for Single-shot control
#define CPU_ETM_O_TRCSSPCICR4                                       0x000002D0

// Selects the PE comparator inputs for Single-shot control
#define CPU_ETM_O_TRCSSPCICR5                                       0x000002D4

// Selects the PE comparator inputs for Single-shot control
#define CPU_ETM_O_TRCSSPCICR6                                       0x000002D8

// Requests the system to provide power to the trace unit
#define CPU_ETM_O_TRCPDCR                                           0x00000310

// Returns the following information about the trace unit: - OS Lock status.  -
// Core power domain status.  - Power interruption status
#define CPU_ETM_O_TRCPDSR                                           0x00000314

// Trace Intergration ATB Identification Register
#define CPU_ETM_O_TRCITATBIDR                                       0x00000EE4

// Trace Integration Instruction ATB In Register
#define CPU_ETM_O_TRCITIATBINR                                      0x00000EF4

// Trace Integration Instruction ATB Out Register
#define CPU_ETM_O_TRCITIATBOUTR                                     0x00000EFC

// Claim Tag Set Register
#define CPU_ETM_O_TRCCLAIMSET                                       0x00000FA0

// Claim Tag Clear Register
#define CPU_ETM_O_TRCCLAIMCLR                                       0x00000FA4

// Returns the level of tracing that the trace unit can support
#define CPU_ETM_O_TRCAUTHSTATUS                                     0x00000FB8

// TRCDEVARCH
#define CPU_ETM_O_TRCDEVARCH                                        0x00000FBC

// TRCDEVID
#define CPU_ETM_O_TRCDEVID                                          0x00000FC8

// TRCDEVTYPE
#define CPU_ETM_O_TRCDEVTYPE                                        0x00000FCC

// TRCPIDR4
#define CPU_ETM_O_TRCPIDR4                                          0x00000FD0

// TRCPIDR5
#define CPU_ETM_O_TRCPIDR5                                          0x00000FD4

// TRCPIDR6
#define CPU_ETM_O_TRCPIDR6                                          0x00000FD8

// TRCPIDR7
#define CPU_ETM_O_TRCPIDR7                                          0x00000FDC

// TRCPIDR0
#define CPU_ETM_O_TRCPIDR0                                          0x00000FE0

// TRCPIDR1
#define CPU_ETM_O_TRCPIDR1                                          0x00000FE4

// TRCPIDR2
#define CPU_ETM_O_TRCPIDR2                                          0x00000FE8

// TRCPIDR3
#define CPU_ETM_O_TRCPIDR3                                          0x00000FEC

// TRCCIDR0
#define CPU_ETM_O_TRCCIDR0                                          0x00000FF0

// TRCCIDR1
#define CPU_ETM_O_TRCCIDR1                                          0x00000FF4

// TRCCIDR2
#define CPU_ETM_O_TRCCIDR2                                          0x00000FF8

// TRCCIDR3
#define CPU_ETM_O_TRCCIDR3                                          0x00000FFC

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPRGCTLR
//
//*****************************************************************************
// Field:     [0] EN
//
// Trace Unit Enable
#define CPU_ETM_TRCPRGCTLR_EN                                       0x00000001
#define CPU_ETM_TRCPRGCTLR_EN_BITN                                           0
#define CPU_ETM_TRCPRGCTLR_EN_M                                     0x00000001
#define CPU_ETM_TRCPRGCTLR_EN_S                                              0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSTATR
//
//*****************************************************************************
// Field:     [1] PMSTABLE
//
// Indicates whether the ETM-Teal registers are stable and can be read
#define CPU_ETM_TRCSTATR_PMSTABLE                                   0x00000002
#define CPU_ETM_TRCSTATR_PMSTABLE_BITN                                       1
#define CPU_ETM_TRCSTATR_PMSTABLE_M                                 0x00000002
#define CPU_ETM_TRCSTATR_PMSTABLE_S                                          1

// Field:     [0] IDLE
//
// Indicates that the trace unit is inactive
#define CPU_ETM_TRCSTATR_IDLE                                       0x00000001
#define CPU_ETM_TRCSTATR_IDLE_BITN                                           0
#define CPU_ETM_TRCSTATR_IDLE_M                                     0x00000001
#define CPU_ETM_TRCSTATR_IDLE_S                                              0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCONFIGR
//
//*****************************************************************************
// Field:    [17] DV
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_DV                                       0x00020000
#define CPU_ETM_TRCCONFIGR_DV_BITN                                          17
#define CPU_ETM_TRCCONFIGR_DV_M                                     0x00020000
#define CPU_ETM_TRCCONFIGR_DV_S                                             17

