espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:    [16] DA
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_DA                                       0x00010000
#define CPU_ETM_TRCCONFIGR_DA_BITN                                          16
#define CPU_ETM_TRCCONFIGR_DA_M                                     0x00010000
#define CPU_ETM_TRCCONFIGR_DA_S                                             16

// Field: [14:13] QE
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_QE_W                                              2
#define CPU_ETM_TRCCONFIGR_QE_M                                     0x00006000
#define CPU_ETM_TRCCONFIGR_QE_S                                             13

// Field:    [12] RS
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_RS                                       0x00001000
#define CPU_ETM_TRCCONFIGR_RS_BITN                                          12
#define CPU_ETM_TRCCONFIGR_RS_M                                     0x00001000
#define CPU_ETM_TRCCONFIGR_RS_S                                             12

// Field:    [11] TS
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_TS                                       0x00000800
#define CPU_ETM_TRCCONFIGR_TS_BITN                                          11
#define CPU_ETM_TRCCONFIGR_TS_M                                     0x00000800
#define CPU_ETM_TRCCONFIGR_TS_S                                             11

// Field:  [10:8] COND
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_COND_W                                            3
#define CPU_ETM_TRCCONFIGR_COND_M                                   0x00000700
#define CPU_ETM_TRCCONFIGR_COND_S                                            8

// Field:     [7] VMID
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_VMID                                     0x00000080
#define CPU_ETM_TRCCONFIGR_VMID_BITN                                         7
#define CPU_ETM_TRCCONFIGR_VMID_M                                   0x00000080
#define CPU_ETM_TRCCONFIGR_VMID_S                                            7

// Field:     [6] CID
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_CID                                      0x00000040
#define CPU_ETM_TRCCONFIGR_CID_BITN                                          6
#define CPU_ETM_TRCCONFIGR_CID_M                                    0x00000040
#define CPU_ETM_TRCCONFIGR_CID_S                                             6

// Field:     [4] CCI
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_CCI                                      0x00000010
#define CPU_ETM_TRCCONFIGR_CCI_BITN                                          4
#define CPU_ETM_TRCCONFIGR_CCI_M                                    0x00000010
#define CPU_ETM_TRCCONFIGR_CCI_S                                             4

// Field:     [3] BB
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_BB                                       0x00000008
#define CPU_ETM_TRCCONFIGR_BB_BITN                                           3
#define CPU_ETM_TRCCONFIGR_BB_M                                     0x00000008
#define CPU_ETM_TRCCONFIGR_BB_S                                              3

// Field:   [2:1] INSTP0
//
// Reserved, `ImpDefRES0
#define CPU_ETM_TRCCONFIGR_INSTP0_W                                          2
#define CPU_ETM_TRCCONFIGR_INSTP0_M                                 0x00000006
#define CPU_ETM_TRCCONFIGR_INSTP0_S                                          1

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCEVENTCTL0R
//
//*****************************************************************************
// Field:    [15] TYPE1
//
// Selects the resource type for event 1
#define CPU_ETM_TRCEVENTCTL0R_TYPE1                                 0x00008000
#define CPU_ETM_TRCEVENTCTL0R_TYPE1_BITN                                    15
#define CPU_ETM_TRCEVENTCTL0R_TYPE1_M                               0x00008000
#define CPU_ETM_TRCEVENTCTL0R_TYPE1_S                                       15

// Field:  [10:8] SEL1
//
// Selects the resource number, based on the value of TYPE1: When TYPE1 is 0,
// selects a single selected resource from 0-15 defined by SEL1[2:0].  When
// TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by
// SEL1[2:0]
#define CPU_ETM_TRCEVENTCTL0R_SEL1_W                                         3
#define CPU_ETM_TRCEVENTCTL0R_SEL1_M                                0x00000700
#define CPU_ETM_TRCEVENTCTL0R_SEL1_S                                         8

// Field:     [7] TYPE0
//
// Selects the resource type for event 0
#define CPU_ETM_TRCEVENTCTL0R_TYPE0                                 0x00000080
#define CPU_ETM_TRCEVENTCTL0R_TYPE0_BITN                                     7
#define CPU_ETM_TRCEVENTCTL0R_TYPE0_M                               0x00000080
#define CPU_ETM_TRCEVENTCTL0R_TYPE0_S                                        7

// Field:   [2:0] SEL0
//
// Selects the resource number, based on the value of TYPE0: When TYPE1 is 0,
// selects a single selected resource from 0-15 defined by SEL0[2:0].  When
// TYPE1 is 1, selects a Boolean combined resource pair from 0-7 defined by
// SEL0[2:0]
#define CPU_ETM_TRCEVENTCTL0R_SEL0_W                                         3
#define CPU_ETM_TRCEVENTCTL0R_SEL0_M                                0x00000007
#define CPU_ETM_TRCEVENTCTL0R_SEL0_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCEVENTCTL1R
//
//*****************************************************************************
// Field:    [12] LPOVERRIDE
//
// Low power state behavior override
#define CPU_ETM_TRCEVENTCTL1R_LPOVERRIDE                            0x00001000
#define CPU_ETM_TRCEVENTCTL1R_LPOVERRIDE_BITN                               12
#define CPU_ETM_TRCEVENTCTL1R_LPOVERRIDE_M                          0x00001000
#define CPU_ETM_TRCEVENTCTL1R_LPOVERRIDE_S                                  12

// Field:    [11] ATB
//
// ATB enabled
#define CPU_ETM_TRCEVENTCTL1R_ATB                                   0x00000800
#define CPU_ETM_TRCEVENTCTL1R_ATB_BITN                                      11
#define CPU_ETM_TRCEVENTCTL1R_ATB_M                                 0x00000800
#define CPU_ETM_TRCEVENTCTL1R_ATB_S                                         11

// Field:     [1] INSTEN1
//
// One bit per event, to enable generation of an event element in the
// instruction trace stream when the selected event occurs
#define CPU_ETM_TRCEVENTCTL1R_INSTEN1                               0x00000002
#define CPU_ETM_TRCEVENTCTL1R_INSTEN1_BITN                                   1
#define CPU_ETM_TRCEVENTCTL1R_INSTEN1_M                             0x00000002
#define CPU_ETM_TRCEVENTCTL1R_INSTEN1_S                                      1

// Field:     [0] INSTEN0
//
// One bit per event, to enable generation of an event element in the
// instruction trace stream when the selected event occurs
#define CPU_ETM_TRCEVENTCTL1R_INSTEN0                               0x00000001
#define CPU_ETM_TRCEVENTCTL1R_INSTEN0_BITN                                   0
#define CPU_ETM_TRCEVENTCTL1R_INSTEN0_M                             0x00000001
#define CPU_ETM_TRCEVENTCTL1R_INSTEN0_S                                      0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSTALLCTLR
//
//*****************************************************************************
// Field:    [10] INSTPRIORITY
//
// Prioritize instruction trace if instruction trace buffer space is less than
// LEVEL
#define CPU_ETM_TRCSTALLCTLR_INSTPRIORITY                           0x00000400
#define CPU_ETM_TRCSTALLCTLR_INSTPRIORITY_BITN                              10
#define CPU_ETM_TRCSTALLCTLR_INSTPRIORITY_M                         0x00000400
#define CPU_ETM_TRCSTALLCTLR_INSTPRIORITY_S                                 10

// Field:     [8] ISTALL
//
// Stall processor based on instruction trace buffer space
#define CPU_ETM_TRCSTALLCTLR_ISTALL                                 0x00000100
#define CPU_ETM_TRCSTALLCTLR_ISTALL_BITN                                     8
#define CPU_ETM_TRCSTALLCTLR_ISTALL_M                               0x00000100
#define CPU_ETM_TRCSTALLCTLR_ISTALL_S                                        8

// Field:   [3:0] LEVEL
//
// Threshold at which stalling becomes active. This provides four levels. This
// level can be varied to optimize the level of invasion caused by stalling,
// balanced against the risk of a FIFO overflow
#define CPU_ETM_TRCSTALLCTLR_LEVEL_W                                         4
#define CPU_ETM_TRCSTALLCTLR_LEVEL_M                                0x0000000F
#define CPU_ETM_TRCSTALLCTLR_LEVEL_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCTSCTLR
//
//*****************************************************************************
// Field:   [7:0] EVENT
//
// An event selector. When the selected event is triggered, the trace unit
// inserts a global timestamp into the trace streams
#define CPU_ETM_TRCTSCTLR_EVENT_W                                            8
#define CPU_ETM_TRCTSCTLR_EVENT_M                                   0x000000FF
#define CPU_ETM_TRCTSCTLR_EVENT_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSYNCPR
//
//*****************************************************************************
// Field:   [4:0] PERIOD
//
// Defines the number of bytes of trace between trace synchronization requests
// as a total of the number of bytes generated by the instruction stream. The
// number of bytes is 2N where N is the value of this field: - A value of zero
// disables these periodic trace synchronization requests, but does not disable
// other trace synchronization requests.  - The minimum value that can be
// programmed, other than zero, is 8, providing a minimum trace synchronization
// period of 256 bytes.  - The maximum value is 20, providing a maximum trace
// synchronization period of 2^20 bytes
#define CPU_ETM_TRCSYNCPR_PERIOD_W                                           5
#define CPU_ETM_TRCSYNCPR_PERIOD_M                                  0x0000001F
#define CPU_ETM_TRCSYNCPR_PERIOD_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCCCTLR
//
//*****************************************************************************
// Field:  [11:0] THRESHOLD
//
// Instruction trace cycle count threshold
#define CPU_ETM_TRCCCCTLR_THRESHOLD_W                                       12
#define CPU_ETM_TRCCCCTLR_THRESHOLD_M                               0x00000FFF
#define CPU_ETM_TRCCCCTLR_THRESHOLD_S                                        0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCVICTLR
//
//*****************************************************************************
// Field:    [19] EXLEVEL_S3
//
// In Secure state, each bit controls whether instruction tracing is enabled
// for the corresponding exception level
#define CPU_ETM_TRCVICTLR_EXLEVEL_S3                                0x00080000
#define CPU_ETM_TRCVICTLR_EXLEVEL_S3_BITN                                   19
#define CPU_ETM_TRCVICTLR_EXLEVEL_S3_M                              0x00080000
#define CPU_ETM_TRCVICTLR_EXLEVEL_S3_S                                      19

// Field:    [16] EXLEVEL_S0
//
// In Secure state, each bit controls whether instruction tracing is enabled
// for the corresponding exception level
#define CPU_ETM_TRCVICTLR_EXLEVEL_S0                                0x00010000
#define CPU_ETM_TRCVICTLR_EXLEVEL_S0_BITN                                   16
#define CPU_ETM_TRCVICTLR_EXLEVEL_S0_M                              0x00010000
#define CPU_ETM_TRCVICTLR_EXLEVEL_S0_S                                      16

// Field:    [11] TRCERR
//
// Selects whether a system error exception must always be traced
#define CPU_ETM_TRCVICTLR_TRCERR                                    0x00000800
#define CPU_ETM_TRCVICTLR_TRCERR_BITN                                       11
#define CPU_ETM_TRCVICTLR_TRCERR_M                                  0x00000800
#define CPU_ETM_TRCVICTLR_TRCERR_S                                          11

// Field:    [10] TRCRESET
//
// Selects whether a reset exception must always be traced
#define CPU_ETM_TRCVICTLR_TRCRESET                                  0x00000400
#define CPU_ETM_TRCVICTLR_TRCRESET_BITN                                     10
#define CPU_ETM_TRCVICTLR_TRCRESET_M                                0x00000400
#define CPU_ETM_TRCVICTLR_TRCRESET_S                                        10

// Field:     [9] SSSTATUS
//
// Indicates the current status of the start/stop logic
#define CPU_ETM_TRCVICTLR_SSSTATUS                                  0x00000200
#define CPU_ETM_TRCVICTLR_SSSTATUS_BITN                                      9
#define CPU_ETM_TRCVICTLR_SSSTATUS_M                                0x00000200
#define CPU_ETM_TRCVICTLR_SSSTATUS_S                                         9

