espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:   [7:0] EVENT
//
// An event selector
#define CPU_ETM_TRCVICTLR_EVENT_W                                            8
#define CPU_ETM_TRCVICTLR_EVENT_M                                   0x000000FF
#define CPU_ETM_TRCVICTLR_EVENT_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCNTRLDVR0
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Defines the reload value for the counter. This value is loaded into the
// counter each time the reload event occurs
#define CPU_ETM_TRCCNTRLDVR0_VALUE_W                                        16
#define CPU_ETM_TRCCNTRLDVR0_VALUE_M                                0x0000FFFF
#define CPU_ETM_TRCCNTRLDVR0_VALUE_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCNTRLDVR1
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Defines the reload value for the counter. This value is loaded into the
// counter each time the reload event occurs
#define CPU_ETM_TRCCNTRLDVR1_VALUE_W                                        16
#define CPU_ETM_TRCCNTRLDVR1_VALUE_M                                0x0000FFFF
#define CPU_ETM_TRCCNTRLDVR1_VALUE_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCNTRLDVR2
//
//*****************************************************************************
// Field:  [15:0] VALUE
//
// Defines the reload value for the counter. This value is loaded into the
// counter each time the reload event occurs
#define CPU_ETM_TRCCNTRLDVR2_VALUE_W                                        16
#define CPU_ETM_TRCCNTRLDVR2_VALUE_M                                0x0000FFFF
#define CPU_ETM_TRCCNTRLDVR2_VALUE_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR8
//
//*****************************************************************************
// Field:  [31:0] MAXSPEC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR8_MAXSPEC_W                                           32
#define CPU_ETM_TRCIDR8_MAXSPEC_M                                   0xFFFFFFFF
#define CPU_ETM_TRCIDR8_MAXSPEC_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR9
//
//*****************************************************************************
// Field:  [31:0] NUMP0KEY
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR9_NUMP0KEY_W                                          32
#define CPU_ETM_TRCIDR9_NUMP0KEY_M                                  0xFFFFFFFF
#define CPU_ETM_TRCIDR9_NUMP0KEY_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR10
//
//*****************************************************************************
// Field:  [31:0] NUMP1KEY
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR10_NUMP1KEY_W                                         32
#define CPU_ETM_TRCIDR10_NUMP1KEY_M                                 0xFFFFFFFF
#define CPU_ETM_TRCIDR10_NUMP1KEY_S                                          0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR11
//
//*****************************************************************************
// Field:  [31:0] NUMP1SPC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR11_NUMP1SPC_W                                         32
#define CPU_ETM_TRCIDR11_NUMP1SPC_M                                 0xFFFFFFFF
#define CPU_ETM_TRCIDR11_NUMP1SPC_S                                          0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR12
//
//*****************************************************************************
// Field:  [31:0] NUMCONDKEY
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR12_NUMCONDKEY_W                                       32
#define CPU_ETM_TRCIDR12_NUMCONDKEY_M                               0xFFFFFFFF
#define CPU_ETM_TRCIDR12_NUMCONDKEY_S                                        0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR13
//
//*****************************************************************************
// Field:  [31:0] NUMCONDSPC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR13_NUMCONDSPC_W                                       32
#define CPU_ETM_TRCIDR13_NUMCONDSPC_M                               0xFFFFFFFF
#define CPU_ETM_TRCIDR13_NUMCONDSPC_S                                        0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIMSPEC0
//
//*****************************************************************************
// Field:   [3:0] SUPPORT
//
// Set to 0. No IMPLEMENTATION SPECIFIC extensions are supported
#define CPU_ETM_TRCIMSPEC0_SUPPORT_W                                         4
#define CPU_ETM_TRCIMSPEC0_SUPPORT_M                                0x0000000F
#define CPU_ETM_TRCIMSPEC0_SUPPORT_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIMSPEC1
//
//*****************************************************************************
// Field:   [3:0] SUPPORT
//
// Set to 0. No IMPLEMENTATION SPECIFIC extensions are supported
#define CPU_ETM_TRCIMSPEC1_SUPPORT_W                                         4
#define CPU_ETM_TRCIMSPEC1_SUPPORT_M                                0x0000000F
#define CPU_ETM_TRCIMSPEC1_SUPPORT_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIMSPEC2
//
//*****************************************************************************
// Field:   [3:0] SUPPORT
//
// Set to 0. No IMPLEMENTATION SPECIFIC extensions are supported
#define CPU_ETM_TRCIMSPEC2_SUPPORT_W                                         4
#define CPU_ETM_TRCIMSPEC2_SUPPORT_M                                0x0000000F
#define CPU_ETM_TRCIMSPEC2_SUPPORT_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIMSPEC3
//
//*****************************************************************************
// Field:   [3:0] SUPPORT
//
// Set to 0. No IMPLEMENTATION SPECIFIC extensions are supported
#define CPU_ETM_TRCIMSPEC3_SUPPORT_W                                         4
#define CPU_ETM_TRCIMSPEC3_SUPPORT_M                                0x0000000F
#define CPU_ETM_TRCIMSPEC3_SUPPORT_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIMSPEC4
//
//*****************************************************************************
// Field:   [3:0] SUPPORT
//
// Set to 0. No IMPLEMENTATION SPECIFIC extensions are supported
#define CPU_ETM_TRCIMSPEC4_SUPPORT_W                                         4
#define CPU_ETM_TRCIMSPEC4_SUPPORT_M                                0x0000000F
#define CPU_ETM_TRCIMSPEC4_SUPPORT_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIMSPEC5
//
//*****************************************************************************
// Field:   [3:0] SUPPORT
//
// Set to 0. No IMPLEMENTATION SPECIFIC extensions are supported
#define CPU_ETM_TRCIMSPEC5_SUPPORT_W                                         4
#define CPU_ETM_TRCIMSPEC5_SUPPORT_M                                0x0000000F
#define CPU_ETM_TRCIMSPEC5_SUPPORT_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIMSPEC6
//
//*****************************************************************************
// Field:   [3:0] SUPPORT
//
// Set to 0. No IMPLEMENTATION SPECIFIC extensions are supported
#define CPU_ETM_TRCIMSPEC6_SUPPORT_W                                         4
#define CPU_ETM_TRCIMSPEC6_SUPPORT_M                                0x0000000F
#define CPU_ETM_TRCIMSPEC6_SUPPORT_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR0
//
//*****************************************************************************
// Field:    [29] COMMOPT
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_COMMOPT                                     0x20000000
#define CPU_ETM_TRCIDR0_COMMOPT_BITN                                        29
#define CPU_ETM_TRCIDR0_COMMOPT_M                                   0x20000000
#define CPU_ETM_TRCIDR0_COMMOPT_S                                           29

