espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field: [28:24] TSSIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_TSSIZE_W                                             5
#define CPU_ETM_TRCIDR0_TSSIZE_M                                    0x1F000000
#define CPU_ETM_TRCIDR0_TSSIZE_S                                            24

// Field:    [17] TRCEXDATA
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_TRCEXDATA                                   0x00020000
#define CPU_ETM_TRCIDR0_TRCEXDATA_BITN                                      17
#define CPU_ETM_TRCIDR0_TRCEXDATA_M                                 0x00020000
#define CPU_ETM_TRCIDR0_TRCEXDATA_S                                         17

// Field: [16:15] QSUPP
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_QSUPP_W                                              2
#define CPU_ETM_TRCIDR0_QSUPP_M                                     0x00018000
#define CPU_ETM_TRCIDR0_QSUPP_S                                             15

// Field:    [14] QFILT
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_QFILT                                       0x00004000
#define CPU_ETM_TRCIDR0_QFILT_BITN                                          14
#define CPU_ETM_TRCIDR0_QFILT_M                                     0x00004000
#define CPU_ETM_TRCIDR0_QFILT_S                                             14

// Field: [13:12] CONDTYPE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_CONDTYPE_W                                           2
#define CPU_ETM_TRCIDR0_CONDTYPE_M                                  0x00003000
#define CPU_ETM_TRCIDR0_CONDTYPE_S                                          12

// Field: [11:10] NUMEVENT
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_NUMEVENT_W                                           2
#define CPU_ETM_TRCIDR0_NUMEVENT_M                                  0x00000C00
#define CPU_ETM_TRCIDR0_NUMEVENT_S                                          10

// Field:     [9] RETSTACK
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_RETSTACK                                    0x00000200
#define CPU_ETM_TRCIDR0_RETSTACK_BITN                                        9
#define CPU_ETM_TRCIDR0_RETSTACK_M                                  0x00000200
#define CPU_ETM_TRCIDR0_RETSTACK_S                                           9

// Field:     [7] TRCCCI
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_TRCCCI                                      0x00000080
#define CPU_ETM_TRCIDR0_TRCCCI_BITN                                          7
#define CPU_ETM_TRCIDR0_TRCCCI_M                                    0x00000080
#define CPU_ETM_TRCIDR0_TRCCCI_S                                             7

// Field:     [6] TRCCOND
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_TRCCOND                                     0x00000040
#define CPU_ETM_TRCIDR0_TRCCOND_BITN                                         6
#define CPU_ETM_TRCIDR0_TRCCOND_M                                   0x00000040
#define CPU_ETM_TRCIDR0_TRCCOND_S                                            6

// Field:     [5] TRCBB
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_TRCBB                                       0x00000020
#define CPU_ETM_TRCIDR0_TRCBB_BITN                                           5
#define CPU_ETM_TRCIDR0_TRCBB_M                                     0x00000020
#define CPU_ETM_TRCIDR0_TRCBB_S                                              5

// Field:   [4:3] TRCDATA
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_TRCDATA_W                                            2
#define CPU_ETM_TRCIDR0_TRCDATA_M                                   0x00000018
#define CPU_ETM_TRCIDR0_TRCDATA_S                                            3

// Field:   [2:1] INSTP0
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR0_INSTP0_W                                             2
#define CPU_ETM_TRCIDR0_INSTP0_M                                    0x00000006
#define CPU_ETM_TRCIDR0_INSTP0_S                                             1

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR1
//
//*****************************************************************************
// Field: [31:24] DESIGNER
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR1_DESIGNER_W                                           8
#define CPU_ETM_TRCIDR1_DESIGNER_M                                  0xFF000000
#define CPU_ETM_TRCIDR1_DESIGNER_S                                          24

// Field:  [11:8] TRCARCHMAJ
//
// reads as 0b0100
#define CPU_ETM_TRCIDR1_TRCARCHMAJ_W                                         4
#define CPU_ETM_TRCIDR1_TRCARCHMAJ_M                                0x00000F00
#define CPU_ETM_TRCIDR1_TRCARCHMAJ_S                                         8

// Field:   [7:4] TRCARCHMIN
//
// reads as 0b0000
#define CPU_ETM_TRCIDR1_TRCARCHMIN_W                                         4
#define CPU_ETM_TRCIDR1_TRCARCHMIN_M                                0x000000F0
#define CPU_ETM_TRCIDR1_TRCARCHMIN_S                                         4

// Field:   [3:0] REVISION
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR1_REVISION_W                                           4
#define CPU_ETM_TRCIDR1_REVISION_M                                  0x0000000F
#define CPU_ETM_TRCIDR1_REVISION_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR2
//
//*****************************************************************************
// Field: [28:25] CCSIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR2_CCSIZE_W                                             4
#define CPU_ETM_TRCIDR2_CCSIZE_M                                    0x1E000000
#define CPU_ETM_TRCIDR2_CCSIZE_S                                            25

// Field: [24:20] DVSIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR2_DVSIZE_W                                             5
#define CPU_ETM_TRCIDR2_DVSIZE_M                                    0x01F00000
#define CPU_ETM_TRCIDR2_DVSIZE_S                                            20

