espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field: [19:15] DASIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR2_DASIZE_W                                             5
#define CPU_ETM_TRCIDR2_DASIZE_M                                    0x000F8000
#define CPU_ETM_TRCIDR2_DASIZE_S                                            15

// Field: [14:10] VMIDSIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR2_VMIDSIZE_W                                           5
#define CPU_ETM_TRCIDR2_VMIDSIZE_M                                  0x00007C00
#define CPU_ETM_TRCIDR2_VMIDSIZE_S                                          10

// Field:   [9:5] CIDSIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR2_CIDSIZE_W                                            5
#define CPU_ETM_TRCIDR2_CIDSIZE_M                                   0x000003E0
#define CPU_ETM_TRCIDR2_CIDSIZE_S                                            5

// Field:   [4:0] IASIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR2_IASIZE_W                                             5
#define CPU_ETM_TRCIDR2_IASIZE_M                                    0x0000001F
#define CPU_ETM_TRCIDR2_IASIZE_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR3
//
//*****************************************************************************
// Field:    [31] NOOVERFLOW
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_NOOVERFLOW                                  0x80000000
#define CPU_ETM_TRCIDR3_NOOVERFLOW_BITN                                     31
#define CPU_ETM_TRCIDR3_NOOVERFLOW_M                                0x80000000
#define CPU_ETM_TRCIDR3_NOOVERFLOW_S                                        31

// Field: [30:28] NUMPROC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_NUMPROC_W                                            3
#define CPU_ETM_TRCIDR3_NUMPROC_M                                   0x70000000
#define CPU_ETM_TRCIDR3_NUMPROC_S                                           28

// Field:    [27] SYSSTALL
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_SYSSTALL                                    0x08000000
#define CPU_ETM_TRCIDR3_SYSSTALL_BITN                                       27
#define CPU_ETM_TRCIDR3_SYSSTALL_M                                  0x08000000
#define CPU_ETM_TRCIDR3_SYSSTALL_S                                          27

// Field:    [26] STALLCTL
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_STALLCTL                                    0x04000000
#define CPU_ETM_TRCIDR3_STALLCTL_BITN                                       26
#define CPU_ETM_TRCIDR3_STALLCTL_M                                  0x04000000
#define CPU_ETM_TRCIDR3_STALLCTL_S                                          26

// Field:    [25] SYNCPR
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_SYNCPR                                      0x02000000
#define CPU_ETM_TRCIDR3_SYNCPR_BITN                                         25
#define CPU_ETM_TRCIDR3_SYNCPR_M                                    0x02000000
#define CPU_ETM_TRCIDR3_SYNCPR_S                                            25

// Field:    [24] TRCERR
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_TRCERR                                      0x01000000
#define CPU_ETM_TRCIDR3_TRCERR_BITN                                         24
#define CPU_ETM_TRCIDR3_TRCERR_M                                    0x01000000
#define CPU_ETM_TRCIDR3_TRCERR_S                                            24

// Field: [23:20] EXLEVEL_NS
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_EXLEVEL_NS_W                                         4
#define CPU_ETM_TRCIDR3_EXLEVEL_NS_M                                0x00F00000
#define CPU_ETM_TRCIDR3_EXLEVEL_NS_S                                        20

// Field: [19:16] EXLEVEL_S
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_EXLEVEL_S_W                                          4
#define CPU_ETM_TRCIDR3_EXLEVEL_S_M                                 0x000F0000
#define CPU_ETM_TRCIDR3_EXLEVEL_S_S                                         16

// Field:  [11:0] CCITMIN
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR3_CCITMIN_W                                           12
#define CPU_ETM_TRCIDR3_CCITMIN_M                                   0x00000FFF
#define CPU_ETM_TRCIDR3_CCITMIN_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR4
//
//*****************************************************************************
// Field: [31:28] NUMVMIDC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_NUMVMIDC_W                                           4
#define CPU_ETM_TRCIDR4_NUMVMIDC_M                                  0xF0000000
#define CPU_ETM_TRCIDR4_NUMVMIDC_S                                          28

// Field: [27:24] NUMCIDC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_NUMCIDC_W                                            4
#define CPU_ETM_TRCIDR4_NUMCIDC_M                                   0x0F000000
#define CPU_ETM_TRCIDR4_NUMCIDC_S                                           24

// Field: [23:20] NUMSSCC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_NUMSSCC_W                                            4
#define CPU_ETM_TRCIDR4_NUMSSCC_M                                   0x00F00000
#define CPU_ETM_TRCIDR4_NUMSSCC_S                                           20

// Field: [19:16] NUMRSPAIR
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_NUMRSPAIR_W                                          4
#define CPU_ETM_TRCIDR4_NUMRSPAIR_M                                 0x000F0000
#define CPU_ETM_TRCIDR4_NUMRSPAIR_S                                         16

// Field: [15:12] NUMPC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_NUMPC_W                                              4
#define CPU_ETM_TRCIDR4_NUMPC_M                                     0x0000F000
#define CPU_ETM_TRCIDR4_NUMPC_S                                             12

