espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:     [8] SUPPDAC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_SUPPDAC                                     0x00000100
#define CPU_ETM_TRCIDR4_SUPPDAC_BITN                                         8
#define CPU_ETM_TRCIDR4_SUPPDAC_M                                   0x00000100
#define CPU_ETM_TRCIDR4_SUPPDAC_S                                            8

// Field:   [7:4] NUMDVC
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_NUMDVC_W                                             4
#define CPU_ETM_TRCIDR4_NUMDVC_M                                    0x000000F0
#define CPU_ETM_TRCIDR4_NUMDVC_S                                             4

// Field:   [3:0] NUMACPAIRS
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR4_NUMACPAIRS_W                                         4
#define CPU_ETM_TRCIDR4_NUMACPAIRS_M                                0x0000000F
#define CPU_ETM_TRCIDR4_NUMACPAIRS_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR5
//
//*****************************************************************************
// Field:    [31] REDFUNCNTR
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR5_REDFUNCNTR                                  0x80000000
#define CPU_ETM_TRCIDR5_REDFUNCNTR_BITN                                     31
#define CPU_ETM_TRCIDR5_REDFUNCNTR_M                                0x80000000
#define CPU_ETM_TRCIDR5_REDFUNCNTR_S                                        31

// Field: [30:28] NUMCNTR
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR5_NUMCNTR_W                                            3
#define CPU_ETM_TRCIDR5_NUMCNTR_M                                   0x70000000
#define CPU_ETM_TRCIDR5_NUMCNTR_S                                           28

// Field: [27:25] NUMSEQSTATE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR5_NUMSEQSTATE_W                                        3
#define CPU_ETM_TRCIDR5_NUMSEQSTATE_M                               0x0E000000
#define CPU_ETM_TRCIDR5_NUMSEQSTATE_S                                       25

// Field:    [23] LPOVERRIDE
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR5_LPOVERRIDE                                  0x00800000
#define CPU_ETM_TRCIDR5_LPOVERRIDE_BITN                                     23
#define CPU_ETM_TRCIDR5_LPOVERRIDE_M                                0x00800000
#define CPU_ETM_TRCIDR5_LPOVERRIDE_S                                        23

// Field:    [22] ATBTRIG
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR5_ATBTRIG                                     0x00400000
#define CPU_ETM_TRCIDR5_ATBTRIG_BITN                                        22
#define CPU_ETM_TRCIDR5_ATBTRIG_M                                   0x00400000
#define CPU_ETM_TRCIDR5_ATBTRIG_S                                           22

// Field: [21:16] TRACEIDSIZE
//
// reads as 0x07
#define CPU_ETM_TRCIDR5_TRACEIDSIZE_W                                        6
#define CPU_ETM_TRCIDR5_TRACEIDSIZE_M                               0x003F0000
#define CPU_ETM_TRCIDR5_TRACEIDSIZE_S                                       16

// Field:  [11:9] NUMEXTINSEL
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR5_NUMEXTINSEL_W                                        3
#define CPU_ETM_TRCIDR5_NUMEXTINSEL_M                               0x00000E00
#define CPU_ETM_TRCIDR5_NUMEXTINSEL_S                                        9

// Field:   [8:0] NUMEXTIN
//
// reads as `ImpDef
#define CPU_ETM_TRCIDR5_NUMEXTIN_W                                           9
#define CPU_ETM_TRCIDR5_NUMEXTIN_M                                  0x000001FF
#define CPU_ETM_TRCIDR5_NUMEXTIN_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR6
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_ETM_O_TRCIDR7
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_ETM_O_TRCRSCTLR2
//
//*****************************************************************************
// Field:    [21] PAIRINV
//
// Inverts the result of a combined pair of resources.  This bit is only
// implemented on the lower register for a pair of resource selectors
#define CPU_ETM_TRCRSCTLR2_PAIRINV                                  0x00200000
#define CPU_ETM_TRCRSCTLR2_PAIRINV_BITN                                     21
#define CPU_ETM_TRCRSCTLR2_PAIRINV_M                                0x00200000
#define CPU_ETM_TRCRSCTLR2_PAIRINV_S                                        21

// Field:    [20] INV
//
// Inverts the selected resources
#define CPU_ETM_TRCRSCTLR2_INV                                      0x00100000
#define CPU_ETM_TRCRSCTLR2_INV_BITN                                         20
#define CPU_ETM_TRCRSCTLR2_INV_M                                    0x00100000
#define CPU_ETM_TRCRSCTLR2_INV_S                                            20

// Field: [18:16] GROUP
//
// Selects a group of resource
#define CPU_ETM_TRCRSCTLR2_GROUP_W                                           3
#define CPU_ETM_TRCRSCTLR2_GROUP_M                                  0x00070000
#define CPU_ETM_TRCRSCTLR2_GROUP_S                                          16

// Field:   [7:0] SELECT
//
// Selects one or more resources from the wanted group. One bit is provided per
// resource from the group
#define CPU_ETM_TRCRSCTLR2_SELECT_W                                          8
#define CPU_ETM_TRCRSCTLR2_SELECT_M                                 0x000000FF
#define CPU_ETM_TRCRSCTLR2_SELECT_S                                          0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCRSCTLR3
//
//*****************************************************************************
// Field:    [21] PAIRINV
//
// Inverts the result of a combined pair of resources.  This bit is only
// implemented on the lower register for a pair of resource selectors
#define CPU_ETM_TRCRSCTLR3_PAIRINV                                  0x00200000
#define CPU_ETM_TRCRSCTLR3_PAIRINV_BITN                                     21
#define CPU_ETM_TRCRSCTLR3_PAIRINV_M                                0x00200000
#define CPU_ETM_TRCRSCTLR3_PAIRINV_S                                        21

// Field:    [20] INV
//
// Inverts the selected resources
#define CPU_ETM_TRCRSCTLR3_INV                                      0x00100000
#define CPU_ETM_TRCRSCTLR3_INV_BITN                                         20
#define CPU_ETM_TRCRSCTLR3_INV_M                                    0x00100000
#define CPU_ETM_TRCRSCTLR3_INV_S                                            20

// Field: [18:16] GROUP
//
// Selects a group of resource
#define CPU_ETM_TRCRSCTLR3_GROUP_W                                           3
#define CPU_ETM_TRCRSCTLR3_GROUP_M                                  0x00070000
#define CPU_ETM_TRCRSCTLR3_GROUP_S                                          16

// Field:   [7:0] SELECT
//
// Selects one or more resources from the wanted group. One bit is provided per
// resource from the group
#define CPU_ETM_TRCRSCTLR3_SELECT_W                                          8
#define CPU_ETM_TRCRSCTLR3_SELECT_M                                 0x000000FF
#define CPU_ETM_TRCRSCTLR3_SELECT_S                                          0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSCSR0
//
//*****************************************************************************
// Field:    [31] STATUS
//
// Single-shot status bit. Indicates if any of the comparators, that
// TRCSSCCRn.SAC or TRCSSCCRn.ARC selects, have matched
#define CPU_ETM_TRCSSCSR0_STATUS                                    0x80000000
#define CPU_ETM_TRCSSCSR0_STATUS_BITN                                       31
#define CPU_ETM_TRCSSCSR0_STATUS_M                                  0x80000000
#define CPU_ETM_TRCSSCSR0_STATUS_S                                          31

