espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:     [3] PC
//
// PE comparator input support. Indicates if the trace unit supports
// Single-shot PE comparator inputs. This field is read-only
#define CPU_ETM_TRCSSCSR0_PC                                        0x00000008
#define CPU_ETM_TRCSSCSR0_PC_BITN                                            3
#define CPU_ETM_TRCSSCSR0_PC_M                                      0x00000008
#define CPU_ETM_TRCSSCSR0_PC_S                                               3

// Field:     [2] DV
//
// Data value comparator support bit. Indicates if the trace unit supports data
// address with data value comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR0_DV                                        0x00000004
#define CPU_ETM_TRCSSCSR0_DV_BITN                                            2
#define CPU_ETM_TRCSSCSR0_DV_M                                      0x00000004
#define CPU_ETM_TRCSSCSR0_DV_S                                               2

// Field:     [1] DA
//
// Data address comparator support bit. Indicates if the trace unit supports
// data address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR0_DA                                        0x00000002
#define CPU_ETM_TRCSSCSR0_DA_BITN                                            1
#define CPU_ETM_TRCSSCSR0_DA_M                                      0x00000002
#define CPU_ETM_TRCSSCSR0_DA_S                                               1

// Field:     [0] INST
//
// Instruction address comparator support bit. Indicates if the trace unit
// supports instruction address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR0_INST                                      0x00000001
#define CPU_ETM_TRCSSCSR0_INST_BITN                                          0
#define CPU_ETM_TRCSSCSR0_INST_M                                    0x00000001
#define CPU_ETM_TRCSSCSR0_INST_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSCSR1
//
//*****************************************************************************
// Field:    [31] STATUS
//
// Single-shot status bit. Indicates if any of the comparators, that
// TRCSSCCRn.SAC or TRCSSCCRn.ARC selects, have matched
#define CPU_ETM_TRCSSCSR1_STATUS                                    0x80000000
#define CPU_ETM_TRCSSCSR1_STATUS_BITN                                       31
#define CPU_ETM_TRCSSCSR1_STATUS_M                                  0x80000000
#define CPU_ETM_TRCSSCSR1_STATUS_S                                          31

// Field:     [3] PC
//
// PE comparator input support. Indicates if the trace unit supports
// Single-shot PE comparator inputs. This field is read-only
#define CPU_ETM_TRCSSCSR1_PC                                        0x00000008
#define CPU_ETM_TRCSSCSR1_PC_BITN                                            3
#define CPU_ETM_TRCSSCSR1_PC_M                                      0x00000008
#define CPU_ETM_TRCSSCSR1_PC_S                                               3

// Field:     [2] DV
//
// Data value comparator support bit. Indicates if the trace unit supports data
// address with data value comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR1_DV                                        0x00000004
#define CPU_ETM_TRCSSCSR1_DV_BITN                                            2
#define CPU_ETM_TRCSSCSR1_DV_M                                      0x00000004
#define CPU_ETM_TRCSSCSR1_DV_S                                               2

// Field:     [1] DA
//
// Data address comparator support bit. Indicates if the trace unit supports
// data address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR1_DA                                        0x00000002
#define CPU_ETM_TRCSSCSR1_DA_BITN                                            1
#define CPU_ETM_TRCSSCSR1_DA_M                                      0x00000002
#define CPU_ETM_TRCSSCSR1_DA_S                                               1

// Field:     [0] INST
//
// Instruction address comparator support bit. Indicates if the trace unit
// supports instruction address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR1_INST                                      0x00000001
#define CPU_ETM_TRCSSCSR1_INST_BITN                                          0
#define CPU_ETM_TRCSSCSR1_INST_M                                    0x00000001
#define CPU_ETM_TRCSSCSR1_INST_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSCSR2
//
//*****************************************************************************
// Field:    [31] STATUS
//
// Single-shot status bit. Indicates if any of the comparators, that
// TRCSSCCRn.SAC or TRCSSCCRn.ARC selects, have matched
#define CPU_ETM_TRCSSCSR2_STATUS                                    0x80000000
#define CPU_ETM_TRCSSCSR2_STATUS_BITN                                       31
#define CPU_ETM_TRCSSCSR2_STATUS_M                                  0x80000000
#define CPU_ETM_TRCSSCSR2_STATUS_S                                          31

// Field:     [3] PC
//
// PE comparator input support. Indicates if the trace unit supports
// Single-shot PE comparator inputs. This field is read-only
#define CPU_ETM_TRCSSCSR2_PC                                        0x00000008
#define CPU_ETM_TRCSSCSR2_PC_BITN                                            3
#define CPU_ETM_TRCSSCSR2_PC_M                                      0x00000008
#define CPU_ETM_TRCSSCSR2_PC_S                                               3

// Field:     [2] DV
//
// Data value comparator support bit. Indicates if the trace unit supports data
// address with data value comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR2_DV                                        0x00000004
#define CPU_ETM_TRCSSCSR2_DV_BITN                                            2
#define CPU_ETM_TRCSSCSR2_DV_M                                      0x00000004
#define CPU_ETM_TRCSSCSR2_DV_S                                               2

// Field:     [1] DA
//
// Data address comparator support bit. Indicates if the trace unit supports
// data address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR2_DA                                        0x00000002
#define CPU_ETM_TRCSSCSR2_DA_BITN                                            1
#define CPU_ETM_TRCSSCSR2_DA_M                                      0x00000002
#define CPU_ETM_TRCSSCSR2_DA_S                                               1

// Field:     [0] INST
//
// Instruction address comparator support bit. Indicates if the trace unit
// supports instruction address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR2_INST                                      0x00000001
#define CPU_ETM_TRCSSCSR2_INST_BITN                                          0
#define CPU_ETM_TRCSSCSR2_INST_M                                    0x00000001
#define CPU_ETM_TRCSSCSR2_INST_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSCSR3
//
//*****************************************************************************
// Field:    [31] STATUS
//
// Single-shot status bit. Indicates if any of the comparators, that
// TRCSSCCRn.SAC or TRCSSCCRn.ARC selects, have matched
#define CPU_ETM_TRCSSCSR3_STATUS                                    0x80000000
#define CPU_ETM_TRCSSCSR3_STATUS_BITN                                       31
#define CPU_ETM_TRCSSCSR3_STATUS_M                                  0x80000000
#define CPU_ETM_TRCSSCSR3_STATUS_S                                          31

