espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:     [3] PC
//
// PE comparator input support. Indicates if the trace unit supports
// Single-shot PE comparator inputs. This field is read-only
#define CPU_ETM_TRCSSCSR6_PC                                        0x00000008
#define CPU_ETM_TRCSSCSR6_PC_BITN                                            3
#define CPU_ETM_TRCSSCSR6_PC_M                                      0x00000008
#define CPU_ETM_TRCSSCSR6_PC_S                                               3

// Field:     [2] DV
//
// Data value comparator support bit. Indicates if the trace unit supports data
// address with data value comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR6_DV                                        0x00000004
#define CPU_ETM_TRCSSCSR6_DV_BITN                                            2
#define CPU_ETM_TRCSSCSR6_DV_M                                      0x00000004
#define CPU_ETM_TRCSSCSR6_DV_S                                               2

// Field:     [1] DA
//
// Data address comparator support bit. Indicates if the trace unit supports
// data address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR6_DA                                        0x00000002
#define CPU_ETM_TRCSSCSR6_DA_BITN                                            1
#define CPU_ETM_TRCSSCSR6_DA_M                                      0x00000002
#define CPU_ETM_TRCSSCSR6_DA_S                                               1

// Field:     [0] INST
//
// Instruction address comparator support bit. Indicates if the trace unit
// supports instruction address comparisons. This field is read-only:
#define CPU_ETM_TRCSSCSR6_INST                                      0x00000001
#define CPU_ETM_TRCSSCSR6_INST_BITN                                          0
#define CPU_ETM_TRCSSCSR6_INST_M                                    0x00000001
#define CPU_ETM_TRCSSCSR6_INST_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSPCICR0
//
//*****************************************************************************
// Field:     [1] PC1
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR0_PC1                                     0x00000002
#define CPU_ETM_TRCSSPCICR0_PC1_BITN                                         1
#define CPU_ETM_TRCSSPCICR0_PC1_M                                   0x00000002
#define CPU_ETM_TRCSSPCICR0_PC1_S                                            1

// Field:     [0] PC0
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR0_PC0                                     0x00000001
#define CPU_ETM_TRCSSPCICR0_PC0_BITN                                         0
#define CPU_ETM_TRCSSPCICR0_PC0_M                                   0x00000001
#define CPU_ETM_TRCSSPCICR0_PC0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSPCICR1
//
//*****************************************************************************
// Field:     [1] PC1
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR1_PC1                                     0x00000002
#define CPU_ETM_TRCSSPCICR1_PC1_BITN                                         1
#define CPU_ETM_TRCSSPCICR1_PC1_M                                   0x00000002
#define CPU_ETM_TRCSSPCICR1_PC1_S                                            1

// Field:     [0] PC0
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR1_PC0                                     0x00000001
#define CPU_ETM_TRCSSPCICR1_PC0_BITN                                         0
#define CPU_ETM_TRCSSPCICR1_PC0_M                                   0x00000001
#define CPU_ETM_TRCSSPCICR1_PC0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSPCICR2
//
//*****************************************************************************
// Field:     [1] PC1
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR2_PC1                                     0x00000002
#define CPU_ETM_TRCSSPCICR2_PC1_BITN                                         1
#define CPU_ETM_TRCSSPCICR2_PC1_M                                   0x00000002
#define CPU_ETM_TRCSSPCICR2_PC1_S                                            1

// Field:     [0] PC0
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR2_PC0                                     0x00000001
#define CPU_ETM_TRCSSPCICR2_PC0_BITN                                         0
#define CPU_ETM_TRCSSPCICR2_PC0_M                                   0x00000001
#define CPU_ETM_TRCSSPCICR2_PC0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSPCICR3
//
//*****************************************************************************
// Field:     [1] PC1
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR3_PC1                                     0x00000002
#define CPU_ETM_TRCSSPCICR3_PC1_BITN                                         1
#define CPU_ETM_TRCSSPCICR3_PC1_M                                   0x00000002
#define CPU_ETM_TRCSSPCICR3_PC1_S                                            1

