espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:     [0] PC0
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR3_PC0                                     0x00000001
#define CPU_ETM_TRCSSPCICR3_PC0_BITN                                         0
#define CPU_ETM_TRCSSPCICR3_PC0_M                                   0x00000001
#define CPU_ETM_TRCSSPCICR3_PC0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSPCICR4
//
//*****************************************************************************
// Field:     [1] PC1
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR4_PC1                                     0x00000002
#define CPU_ETM_TRCSSPCICR4_PC1_BITN                                         1
#define CPU_ETM_TRCSSPCICR4_PC1_M                                   0x00000002
#define CPU_ETM_TRCSSPCICR4_PC1_S                                            1

// Field:     [0] PC0
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR4_PC0                                     0x00000001
#define CPU_ETM_TRCSSPCICR4_PC0_BITN                                         0
#define CPU_ETM_TRCSSPCICR4_PC0_M                                   0x00000001
#define CPU_ETM_TRCSSPCICR4_PC0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSPCICR5
//
//*****************************************************************************
// Field:     [1] PC1
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR5_PC1                                     0x00000002
#define CPU_ETM_TRCSSPCICR5_PC1_BITN                                         1
#define CPU_ETM_TRCSSPCICR5_PC1_M                                   0x00000002
#define CPU_ETM_TRCSSPCICR5_PC1_S                                            1

// Field:     [0] PC0
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR5_PC0                                     0x00000001
#define CPU_ETM_TRCSSPCICR5_PC0_BITN                                         0
#define CPU_ETM_TRCSSPCICR5_PC0_M                                   0x00000001
#define CPU_ETM_TRCSSPCICR5_PC0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCSSPCICR6
//
//*****************************************************************************
// Field:     [1] PC1
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR6_PC1                                     0x00000002
#define CPU_ETM_TRCSSPCICR6_PC1_BITN                                         1
#define CPU_ETM_TRCSSPCICR6_PC1_M                                   0x00000002
#define CPU_ETM_TRCSSPCICR6_PC1_S                                            1

// Field:     [0] PC0
//
// Selects one or more PE comparator inputs for Single-shot control.
// TRCIDR4.NUMPC defines the size of the PC field.  1 bit is provided for each
// implemented PE comparator input.  For example, if bit[1] == 1 this selects
// PE comparator input 1 for Single-shot control
#define CPU_ETM_TRCSSPCICR6_PC0                                     0x00000001
#define CPU_ETM_TRCSSPCICR6_PC0_BITN                                         0
#define CPU_ETM_TRCSSPCICR6_PC0_M                                   0x00000001
#define CPU_ETM_TRCSSPCICR6_PC0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPDCR
//
//*****************************************************************************
// Field:     [3] PU
//
// Powerup request bit:
#define CPU_ETM_TRCPDCR_PU                                          0x00000008
#define CPU_ETM_TRCPDCR_PU_BITN                                              3
#define CPU_ETM_TRCPDCR_PU_M                                        0x00000008
#define CPU_ETM_TRCPDCR_PU_S                                                 3

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPDSR
//
//*****************************************************************************
// Field:     [5] OSLK
//
// OS Lock status bit:
#define CPU_ETM_TRCPDSR_OSLK                                        0x00000020
#define CPU_ETM_TRCPDSR_OSLK_BITN                                            5
#define CPU_ETM_TRCPDSR_OSLK_M                                      0x00000020
#define CPU_ETM_TRCPDSR_OSLK_S                                               5

// Field:     [1] STICKYPD
//
// Sticky powerdown status bit. Indicates whether the trace register state is
// valid:
#define CPU_ETM_TRCPDSR_STICKYPD                                    0x00000002
#define CPU_ETM_TRCPDSR_STICKYPD_BITN                                        1
#define CPU_ETM_TRCPDSR_STICKYPD_M                                  0x00000002
#define CPU_ETM_TRCPDSR_STICKYPD_S                                           1

// Field:     [0] POWER
//
// Power status bit:
#define CPU_ETM_TRCPDSR_POWER                                       0x00000001
#define CPU_ETM_TRCPDSR_POWER_BITN                                           0
#define CPU_ETM_TRCPDSR_POWER_M                                     0x00000001
#define CPU_ETM_TRCPDSR_POWER_S                                              0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCITATBIDR
//
//*****************************************************************************
// Field:   [6:0] ID
//
// Trace ID
#define CPU_ETM_TRCITATBIDR_ID_W                                             7
#define CPU_ETM_TRCITATBIDR_ID_M                                    0x0000007F
#define CPU_ETM_TRCITATBIDR_ID_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCITIATBINR
//
//*****************************************************************************
// Field:     [1] AFVALIDM
//
// Integration Mode instruction AFVALIDM in
#define CPU_ETM_TRCITIATBINR_AFVALIDM                               0x00000002
#define CPU_ETM_TRCITIATBINR_AFVALIDM_BITN                                   1
#define CPU_ETM_TRCITIATBINR_AFVALIDM_M                             0x00000002
#define CPU_ETM_TRCITIATBINR_AFVALIDM_S                                      1

// Field:     [0] ATREADYM
//
// Integration Mode instruction ATREADYM in
#define CPU_ETM_TRCITIATBINR_ATREADYM                               0x00000001
#define CPU_ETM_TRCITIATBINR_ATREADYM_BITN                                   0
#define CPU_ETM_TRCITIATBINR_ATREADYM_M                             0x00000001
#define CPU_ETM_TRCITIATBINR_ATREADYM_S                                      0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCITIATBOUTR
//
//*****************************************************************************
// Field:     [1] AFREADY
//
// Integration Mode instruction AFREADY out
#define CPU_ETM_TRCITIATBOUTR_AFREADY                               0x00000002
#define CPU_ETM_TRCITIATBOUTR_AFREADY_BITN                                   1
#define CPU_ETM_TRCITIATBOUTR_AFREADY_M                             0x00000002
#define CPU_ETM_TRCITIATBOUTR_AFREADY_S                                      1

// Field:     [0] ATVALID
//
// Integration Mode instruction ATVALID out
#define CPU_ETM_TRCITIATBOUTR_ATVALID                               0x00000001
#define CPU_ETM_TRCITIATBOUTR_ATVALID_BITN                                   0
#define CPU_ETM_TRCITIATBOUTR_ATVALID_M                             0x00000001
#define CPU_ETM_TRCITIATBOUTR_ATVALID_S                                      0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCLAIMSET
//
//*****************************************************************************
// Field:     [3] SET3
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMSET_SET3                                    0x00000008
#define CPU_ETM_TRCCLAIMSET_SET3_BITN                                        3
#define CPU_ETM_TRCCLAIMSET_SET3_M                                  0x00000008
#define CPU_ETM_TRCCLAIMSET_SET3_S                                           3

// Field:     [2] SET2
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMSET_SET2                                    0x00000004
#define CPU_ETM_TRCCLAIMSET_SET2_BITN                                        2
#define CPU_ETM_TRCCLAIMSET_SET2_M                                  0x00000004
#define CPU_ETM_TRCCLAIMSET_SET2_S                                           2

// Field:     [1] SET1
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMSET_SET1                                    0x00000002
#define CPU_ETM_TRCCLAIMSET_SET1_BITN                                        1
#define CPU_ETM_TRCCLAIMSET_SET1_M                                  0x00000002
#define CPU_ETM_TRCCLAIMSET_SET1_S                                           1

// Field:     [0] SET0
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMSET_SET0                                    0x00000001
#define CPU_ETM_TRCCLAIMSET_SET0_BITN                                        0
#define CPU_ETM_TRCCLAIMSET_SET0_M                                  0x00000001
#define CPU_ETM_TRCCLAIMSET_SET0_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCLAIMCLR
//
//*****************************************************************************
// Field:     [3] CLR3
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMCLR_CLR3                                    0x00000008
#define CPU_ETM_TRCCLAIMCLR_CLR3_BITN                                        3
#define CPU_ETM_TRCCLAIMCLR_CLR3_M                                  0x00000008
#define CPU_ETM_TRCCLAIMCLR_CLR3_S                                           3

