espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:     [2] CLR2
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMCLR_CLR2                                    0x00000004
#define CPU_ETM_TRCCLAIMCLR_CLR2_BITN                                        2
#define CPU_ETM_TRCCLAIMCLR_CLR2_M                                  0x00000004
#define CPU_ETM_TRCCLAIMCLR_CLR2_S                                           2

// Field:     [1] CLR1
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMCLR_CLR1                                    0x00000002
#define CPU_ETM_TRCCLAIMCLR_CLR1_BITN                                        1
#define CPU_ETM_TRCCLAIMCLR_CLR1_M                                  0x00000002
#define CPU_ETM_TRCCLAIMCLR_CLR1_S                                           1

// Field:     [0] CLR0
//
// When a write to one of these bits occurs, with the value:
#define CPU_ETM_TRCCLAIMCLR_CLR0                                    0x00000001
#define CPU_ETM_TRCCLAIMCLR_CLR0_BITN                                        0
#define CPU_ETM_TRCCLAIMCLR_CLR0_M                                  0x00000001
#define CPU_ETM_TRCCLAIMCLR_CLR0_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCAUTHSTATUS
//
//*****************************************************************************
// Field:   [7:6] SNID
//
// Indicates whether the system enables the trace unit to support Secure
// non-invasive debug:
#define CPU_ETM_TRCAUTHSTATUS_SNID_W                                         2
#define CPU_ETM_TRCAUTHSTATUS_SNID_M                                0x000000C0
#define CPU_ETM_TRCAUTHSTATUS_SNID_S                                         6

// Field:   [5:4] SID
//
// Indicates whether the trace unit supports Secure invasive debug:
#define CPU_ETM_TRCAUTHSTATUS_SID_W                                          2
#define CPU_ETM_TRCAUTHSTATUS_SID_M                                 0x00000030
#define CPU_ETM_TRCAUTHSTATUS_SID_S                                          4

// Field:   [3:2] NSNID
//
// Indicates whether the system enables the trace unit to support Non-secure
// non-invasive debug:
#define CPU_ETM_TRCAUTHSTATUS_NSNID_W                                        2
#define CPU_ETM_TRCAUTHSTATUS_NSNID_M                               0x0000000C
#define CPU_ETM_TRCAUTHSTATUS_NSNID_S                                        2

// Field:   [1:0] NSID
//
// Indicates whether the trace unit supports Non-secure invasive debug:
#define CPU_ETM_TRCAUTHSTATUS_NSID_W                                         2
#define CPU_ETM_TRCAUTHSTATUS_NSID_M                                0x00000003
#define CPU_ETM_TRCAUTHSTATUS_NSID_S                                         0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCDEVARCH
//
//*****************************************************************************
// Field: [31:21] ARCHITECT
//
// reads as 0b01000111011
#define CPU_ETM_TRCDEVARCH_ARCHITECT_W                                      11
#define CPU_ETM_TRCDEVARCH_ARCHITECT_M                              0xFFE00000
#define CPU_ETM_TRCDEVARCH_ARCHITECT_S                                      21

// Field:    [20] PRESENT
//
// reads as 0b1
#define CPU_ETM_TRCDEVARCH_PRESENT                                  0x00100000
#define CPU_ETM_TRCDEVARCH_PRESENT_BITN                                     20
#define CPU_ETM_TRCDEVARCH_PRESENT_M                                0x00100000
#define CPU_ETM_TRCDEVARCH_PRESENT_S                                        20

// Field: [19:16] REVISION
//
// reads as 0b0000
#define CPU_ETM_TRCDEVARCH_REVISION_W                                        4
#define CPU_ETM_TRCDEVARCH_REVISION_M                               0x000F0000
#define CPU_ETM_TRCDEVARCH_REVISION_S                                       16

// Field:  [15:0] ARCHID
//
// reads as 0b0100101000010011
#define CPU_ETM_TRCDEVARCH_ARCHID_W                                         16
#define CPU_ETM_TRCDEVARCH_ARCHID_M                                 0x0000FFFF
#define CPU_ETM_TRCDEVARCH_ARCHID_S                                          0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCDEVID
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_ETM_O_TRCDEVTYPE
//
//*****************************************************************************
// Field:   [7:4] SUB
//
// reads as 0b0001
#define CPU_ETM_TRCDEVTYPE_SUB_W                                             4
#define CPU_ETM_TRCDEVTYPE_SUB_M                                    0x000000F0
#define CPU_ETM_TRCDEVTYPE_SUB_S                                             4

// Field:   [3:0] MAJOR
//
// reads as 0b0011
#define CPU_ETM_TRCDEVTYPE_MAJOR_W                                           4
#define CPU_ETM_TRCDEVTYPE_MAJOR_M                                  0x0000000F
#define CPU_ETM_TRCDEVTYPE_MAJOR_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR4
//
//*****************************************************************************
// Field:   [7:4] SIZE
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR4_SIZE_W                                              4
#define CPU_ETM_TRCPIDR4_SIZE_M                                     0x000000F0
#define CPU_ETM_TRCPIDR4_SIZE_S                                              4

// Field:   [3:0] DES_2
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR4_DES_2_W                                             4
#define CPU_ETM_TRCPIDR4_DES_2_M                                    0x0000000F
#define CPU_ETM_TRCPIDR4_DES_2_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR5
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR6
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR7
//
//*****************************************************************************
//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR0
//
//*****************************************************************************
// Field:   [7:0] PART_0
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR0_PART_0_W                                            8
#define CPU_ETM_TRCPIDR0_PART_0_M                                   0x000000FF
#define CPU_ETM_TRCPIDR0_PART_0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR1
//
//*****************************************************************************
// Field:   [7:4] DES_0
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR1_DES_0_W                                             4
#define CPU_ETM_TRCPIDR1_DES_0_M                                    0x000000F0
#define CPU_ETM_TRCPIDR1_DES_0_S                                             4

