espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/ti_simplelink_sdk/repo_cc13xx_cc26xx/source/ti/devices/cc13x4_cc26x4/inc/hw_cpu_etm.h
// Field:   [3:0] PART_0
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR1_PART_0_W                                            4
#define CPU_ETM_TRCPIDR1_PART_0_M                                   0x0000000F
#define CPU_ETM_TRCPIDR1_PART_0_S                                            0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR2
//
//*****************************************************************************
// Field:   [7:4] REVISION
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR2_REVISION_W                                          4
#define CPU_ETM_TRCPIDR2_REVISION_M                                 0x000000F0
#define CPU_ETM_TRCPIDR2_REVISION_S                                          4

// Field:     [3] JEDEC
//
// reads as 0b1
#define CPU_ETM_TRCPIDR2_JEDEC                                      0x00000008
#define CPU_ETM_TRCPIDR2_JEDEC_BITN                                          3
#define CPU_ETM_TRCPIDR2_JEDEC_M                                    0x00000008
#define CPU_ETM_TRCPIDR2_JEDEC_S                                             3

// Field:   [2:0] DES_0
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR2_DES_0_W                                             3
#define CPU_ETM_TRCPIDR2_DES_0_M                                    0x00000007
#define CPU_ETM_TRCPIDR2_DES_0_S                                             0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCPIDR3
//
//*****************************************************************************
// Field:   [7:4] REVAND
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR3_REVAND_W                                            4
#define CPU_ETM_TRCPIDR3_REVAND_M                                   0x000000F0
#define CPU_ETM_TRCPIDR3_REVAND_S                                            4

// Field:   [3:0] CMOD
//
// reads as `ImpDef
#define CPU_ETM_TRCPIDR3_CMOD_W                                              4
#define CPU_ETM_TRCPIDR3_CMOD_M                                     0x0000000F
#define CPU_ETM_TRCPIDR3_CMOD_S                                              0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCIDR0
//
//*****************************************************************************
// Field:   [7:0] PRMBL_0
//
// reads as 0b00001101
#define CPU_ETM_TRCCIDR0_PRMBL_0_W                                           8
#define CPU_ETM_TRCCIDR0_PRMBL_0_M                                  0x000000FF
#define CPU_ETM_TRCCIDR0_PRMBL_0_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCIDR1
//
//*****************************************************************************
// Field:   [7:4] CLASS
//
// reads as 0b1001
#define CPU_ETM_TRCCIDR1_CLASS_W                                             4
#define CPU_ETM_TRCCIDR1_CLASS_M                                    0x000000F0
#define CPU_ETM_TRCCIDR1_CLASS_S                                             4

// Field:   [3:0] PRMBL_1
//
// reads as 0b0000
#define CPU_ETM_TRCCIDR1_PRMBL_1_W                                           4
#define CPU_ETM_TRCCIDR1_PRMBL_1_M                                  0x0000000F
#define CPU_ETM_TRCCIDR1_PRMBL_1_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCIDR2
//
//*****************************************************************************
// Field:   [7:0] PRMBL_2
//
// reads as 0b00000101
#define CPU_ETM_TRCCIDR2_PRMBL_2_W                                           8
#define CPU_ETM_TRCCIDR2_PRMBL_2_M                                  0x000000FF
#define CPU_ETM_TRCCIDR2_PRMBL_2_S                                           0

//*****************************************************************************
//
// Register: CPU_ETM_O_TRCCIDR3
//
//*****************************************************************************
// Field:   [7:0] PRMBL_3
//
// reads as 0b10110001
#define CPU_ETM_TRCCIDR3_PRMBL_3_W                                           8
#define CPU_ETM_TRCCIDR3_PRMBL_3_M                                  0x000000FF
#define CPU_ETM_TRCCIDR3_PRMBL_3_S                                           0


#endif // __CPU_ETM__
